## -------------------------------------------------------------------- ##

## 1.Planning
# 비즈니스 도메인 이해하기
# 프로젝트 목표정의 하기
# 데이터 이해하기
# 평가 기준정의
# 위험관리 계획
# 프로젝트 계획수립

## 2.Data preparing
#데이터 탐색
# 데이터 시각화

## 3.Data analyzing
# 가설수립 및 검증
# 변수 선택
# 정형데이터 분석
# 모델선택
# 모델구축
# 모델평가

## 4.System developing(웹 어플리캐이션 개발)
# 운영데이터 준비
# 시스템 설계 및 개발
# 모델확인

## 5.Deploying
# 배포계획 수립
# 모니터링 및 유지보수모델 및 시스템
# 재건축모델 및 시스템계획
# 모델 유효성 검사
# 프로젝트마무리


### step1
## R
setwd("C:/Repository/python_basic/7R")

data_claim <- read.csv("./Data/R_Hanhwa_Data/BGCON_CLAIM_DATA.csv")

## -------------------------------------------------------------------- ##

### step2

## -------------------------------------------------------------------- ##

### step3

## -------------------------------------------------------------------- ##

### step4